Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: ``del x`` doesn't directly call ``x.__del__()`` --- the former decrements the reference count for ``x`` by one, and the latter is only called when ``x``'s reference count reaches zero. Some common situations that may prevent the reference count of an object from going to zero include: circular references between objects (e.g., a doubly-linked list or a tree data structure with parent and child pointers); a reference to the object on the stack frame of a function that caught an exception (the traceback stored in ``sys.exc_info()[2]`` keeps the stack frame alive); or a reference to the object on the stack frame that raised an unhandled exception in interactive mode (the traceback stored in ``sys.last_traceback`` keeps the stack frame alive). The first situation can only be remedied by explicitly breaking the cycles; the latter two situations can be resolved by storing ``None`` in ``sys.last_traceback``. Circular references which are garbage are detected when the option cycle detector is enabled (it's on by default), but can only be cleaned up if there are no Python- level :meth:`__del__` methods involved. Refer to the documentation for the :mod:`gc` module for more information about how :meth:`__del__` methods are handled by the cycle detector, particularly the description of the ``garbage`` value.
ru: «``del x``» лишь уменьшает на 1 счётчик ссылок на «``x``» , а не вызывает напрямую «``x.__del__()``» , который вызывается только когда счётчик ссылок достигает ноля. Среди ситуаций, при которых счётчик ссылок на объект не может обнулиться, самыми обычными являются : циклические ссылки между объектами (например, список с двухсторонними связями, или древовидная структура данных с указателями на родителя и потомка) ; ссылка на объект в кадре стека функции, которая получила исключение (раскрутка стека, содержащаяся в «``sys.exc_info()[2]``» , имея ссылку на этот кадр стека, не даёт его уничтожить) ; или ссылка на объект в том кадре стека, в котором произошло необработанное исключение в интерактивном режиме (раскрутка стека, содержащаяся в «``sys.last_traceback``» , имея ссылку на этот кадр стека, не даёт его уничтожить) . Первая ситуация может быть исправлена только путем явного разрывания цикла, а две последние ситуации могут быть решены путём записи «:const:`None`» в «``sys.last_traceback``» . Циклические ссылки, являющиеся “мусором” , детектируются если включена опция обнаружения циклов (по умолчанию включена) , но могут быть удалены только если не задействованы методы Питоновского уровня «:meth:`__del__`» . Обратитесь к документации модуля «:mod:`gc`» за более подробной информацией о том, как детектор циклов обращается с методами «:meth:`__del__`» , в частности описание значения у ``garbage`` .

source: Due to the precarious circumstances under which :meth:`__del__` methods are invoked, exceptions that occur during their execution are ignored, and a warning is printed to ``sys.stderr`` instead. Also, when :meth:`__del__` is invoked in response to a module being deleted (e.g., when execution of the program is done), other globals referenced by the :meth:`__del__` method may already have been deleted or in the process of being torn down (e.g. the import machinery shutting down). For this reason, :meth:`__del__` methods should do the absolute minimum needed to maintain external invariants. Starting with version 1.5, Python guarantees that globals whose name begins with a single underscore are deleted from their module before other globals are deleted; if no other references to such globals exist, this may help in assuring that imported modules are still available at the time when the :meth:`__del__` method is called.
ru: По причине ненадёжной ситуации, в которой вызываются методы «:meth:`__del__`» , исключения, возникающие при их исполнении, игнорируются, и вместо этого печатаются предупреждения в «``sys.stderr``» . Также, когда «:meth:`__del__`» вызывается для удаления модуля (например, когда исполнение программы завершено) , глобальные переменные, на которые ссылается метод «:meth:`__del__`» , могут уже быть удалены или в процессе удаления (например, отключение механизма импорта) . По этой причине методам «:meth:`__del__`» следует производить самый минимум необходимого для поддержания внешней целостности . Начиная с версии 1.5 , Питон гарантирует, что глобальные переменные, чьё имя начинается с одиночного подчёркивания, будут удалены из их модуля до удаления остальных глобальных переменных. Если нет других ссылок на такие глобальные переменные, то это может помочь убедиться, что импортированные модули ещё доступны в то время, когда вызывается метод «:meth:`__del__`» .

source: Called by the :func:`repr` built-in function to compute the "official" string representation of an object. If at all possible, this should look like a valid Python expression that could be used to recreate an object with the same value (given an appropriate environment). If this is not possible, a string of the form ``<...some useful description...>`` should be returned. The return value must be a string object. If a class defines :meth:`__repr__` but not :meth:`__str__`, then :meth:`__repr__` is also used when an "informal" string representation of instances of that class is required.
ru: Вызывается встроенной функцией «:func:`repr`» для вычисления «официального» текстового представления (текстовый объект) для исходного объекта. В тех случаях, когда это вообще возможно – это текст должен быть правильным выражением на Питоне, который, при его интерпретации, даст обратно объект с тем же значением (при условии такого же окружения) . А когда это не возможно – будет возвращён текст вида : «``<…полезное описание…>``» . Если в классе определён «:meth:`__repr__`» , но не определён «:meth:`__str__`» , то «:meth:`__repr__`» используется также и вместо «:meth:`__str__`» .

source: This is typically used for debugging, so it is important that the representation is information-rich and unambiguous.
ru: Это обычно используется для отладки, поэтому важно, чтобы это представление было информационно богатыми и недвусмысленным.

source: Called by the :func:`str` built-in function and by the :func:`print` function to compute the "informal" string representation of an object. This differs from :meth:`__repr__` in that it does not have to be a valid Python expression: a more convenient or concise representation may be used instead. The return value must be a string object.
ru: Вызывается встроенной функцией «:func:`str`» и функцией «:func:`print`» для вычисления “неформального” текстового представления (текстовый объект) для исходного объекта. Отличается от «:meth:`__repr__`» тем, что не обязан выдавать правильное выражение на Питоне, вместо этого может выдать более удобный или лаконичный текст.

source: Called by the :func:`format` built-in function (and by extension, the :meth:`format` method of class :class:`str`) to produce a "formatted" string representation of an object. The ``format_spec`` argument is a string that contains a description of the formatting options desired. The interpretation of the ``format_spec`` argument is up to the type implementing :meth:`__format__`, however most classes will either delegate formatting to one of the built-in types, or use a similar formatting option syntax.
ru: Вызывается встроенной функцией «:func:`format`» для получения “форматированого” текстового представления (текстовый объект) для исходного объекта. Аргумент «``format_spec``» является строкой, содержащей описание требуемых опций форматирования. Интерпретация этого аргумента полагается на реализацию метода «:meth:`__format__`» у соответствующего типа, хотя большинство классов будут перепоручать форматирование одному из встроенных типов, или использовать аналогичный синтаксис опций форматирования.

source: See :ref:`formatspec` for a description of the standard formatting syntax.
ru: Описание стандарта синтаксиса форматирования смотрите в :ref:`formatspec` .

source: The return value must be a string object.
ru: Возвращаемое значение должно быть текстовым объектом.

source: These are the so-called "rich comparison" methods. The correspondence between operator symbols and method names is as follows: ``x<y`` calls ``x.__lt__(y)``, ``x<=y`` calls ``x.__le__(y)``, ``x==y`` calls ``x.__eq__(y)``, ``x!=y`` calls ``x.__ne__(y)``, ``x>y`` calls ``x.__gt__(y)``, and ``x>=y`` calls ``x.__ge__(y)``.
ru: Это так называемые методы “расширенного сравнения” (“rich comparison”) . Соответствие между символами операторов и именами методов такое : «``x<y``» вызывает «``x.__lt__(y)``» , «``x<=y``» вызывает «``x.__le__(y)``» , «``x==y``» вызывает «``x.__eq__(y)``» , «``x!=y``» вызывает «``x.__ne__(y)``» , «``x>y``» вызывает «``x.__gt__(y)``» , «``x>=y``» вызывает «``x.__ge__(y)``» .

source: A rich comparison method may return the singleton ``NotImplemented`` if it does not implement the operation for a given pair of arguments. By convention, ``False`` and ``True`` are returned for a successful comparison. However, these methods can return any value, so if the comparison operator is used in a Boolean context (e.g., in the condition of an ``if`` statement), Python will call :func:`bool` on the value to determine if the result is true or false.
ru: Метод расширенного сравнения может возвращать синглтон «``NotImplemented``» , если в нём не реализована операция сравнения для данной пары аргументов. По соглашению – в случае успешных сравнений возвращается «:const:`False`» или «:const:`True`» . Однако, эти методы могут возвращать любое значение – так что, если эти операторы сравнения используются там, где требуется логический (булев) результат (например условие инструкции «:keyword:`if`» ) , то Питон применит «:func:`bool`» к этим значениям (чтобы привести их к булеву типу) .

source: There are no implied relationships among the comparison operators. The truth of ``x==y`` does not imply that ``x!=y`` is false. Accordingly, when defining :meth:`__eq__`, one should also define :meth:`__ne__` so that the operators will behave as expected. See the paragraph on :meth:`__hash__` for some important notes on creating :term:`hashable` objects which support custom comparison operations and are usable as dictionary keys.
ru: Нет неявно подразумеваемых соотношений между операторами сравнения. Истинность «``x==y``» не означает, что «``x!=y``» ложно. Таким образом, определяя «:meth:`__eq__`» , следует также определить «:meth:`__ne__`» – только тогда операторы будут вести себя, как ожидалось. Смотрите в пункте о «:meth:`__hash__`» некоторые важные замечания о создании хэшируемых объектов, которые поддерживают пользовательские операции сравнения и могут использоваться в качестве ключей словаря.

source: There are no swapped-argument versions of these methods (to be used when the left argument does not support the operation but the right argument does); rather, :meth:`__lt__` and :meth:`__gt__` are each other's reflection, :meth:`__le__` and :meth:`__ge__` are each other's reflection, and :meth:`__eq__` and :meth:`__ne__` are their own reflection.
ru: Для этих методов нету реализации автоматической замены порядка аргументов (когда левый аргумент не поддерживает данную операцию, а правый поддерживает) . Но, вместо этого можно воспользоваться тем, что «:meth:`__lt__`» с «:meth:`__gt__`» , «:meth:`__le__`» с «:meth:`__ge__`» , «:meth:`__eq__`» с «:meth:`__ne__`» являются противоположностями друг друга (попарно) .

source: Arguments to rich comparison methods are never coerced.
ru: Для аргументов расширенных сравнений никогда не производится приведение типов.

source: To automatically generate ordering operations from a single root operation, see :func:`functools.total_ordering`.
ru: Об автоматической генерации операций сравнения на основе одной операции смотрите :func:`functools.total_ordering` .

source: If a class does not define an :meth:`__eq__` method it should not define a :meth:`__hash__` operation either; if it defines :meth:`__eq__` but not :meth:`__hash__`, its instances will not be usable as items in hashable collections. If a class defines mutable objects and implements an :meth:`__eq__` method, it should not implement :meth:`__hash__`, since the implementation of hashable collections requires that a key's hash value is immutable (if the object's hash value changes, it will be in the wrong hash bucket).
ru: Если класс не определяет метод «:meth:`__eq__`» , то он не должен определять метод «:meth:`__hash__`» , а если он определяет «:meth:`__eq__`» , но не определяет «:meth:`__hash__`» , то его экземпляры не смогут быть использованы как элементы хэшируемых множеств. Если класс определяет изменяемые объекты и реализует метод «:meth:`__eq__`» , то он не должен реализовывать «:meth:`__hash__`» , поскольку реализация хэшируемых множеств требует, чтобы значение хэша ключей было неизменяемым (если значение хэша ключа объекта изменяется, то оно может оказаться не в своей группе хэшей (“hash bucket”) (и будет пропущено при поиске) ) .

source: User-defined classes have :meth:`__eq__` and :meth:`__hash__` methods by default; with them, all objects compare unequal (except with themselves) and ``x.__hash__()`` returns ``id(x)``.
ru: Определяемые пользователем классы по умолчанию имеют методы «:meth:`__eq__`» и «:meth:`__hash__`» , из-за которых все объекты экземпляров этих классов являются неравными друг другу (они равны только сами себе) , а «``x.__hash__()``» возвращает «``id(x)``» .

source: Classes which inherit a :meth:`__hash__` method from a parent class but change the meaning of :meth:`__eq__` such that the hash value returned is no longer appropriate (e.g. by switching to a value-based concept of equality instead of the default identity based equality) can explicitly flag themselves as being unhashable by setting ``__hash__ = None`` in the class definition. Doing so means that not only will instances of the class raise an appropriate :exc:`TypeError` when a program attempts to retrieve their hash value, but they will also be correctly identified as unhashable when checking ``isinstance(obj, collections.Hashable)`` (unlike classes which define their own :meth:`__hash__` to explicitly raise :exc:`TypeError`).
ru: Классы, которые наследуют метод «:meth:`__hash__`» из родительского класса, но изменяют значение «:meth:`__eq__`» так, что возвращаемое значение хэша уже теряет разумный смысл (например, переходя к концепции сравнения на основании значения вместо стандартного сравнения на основе уникальных идентификаторов) могут явным образом обозначить себя как нехэшируемые установив «``__hash__ = None``» в определении класса. Такое действие приведёт не только к тому, что экземпляры данного класса будут вызывать соответствующее исключение «:exc:`TypeError`» , когда программа попытается получить их значение хэша, но и к тому, что экземпляры будут правильно идентифицированы как нехэшируемые при проверке «``isinstance(obj, collections.Hashable)``» (в отличие от классов, которые определили собственный «:meth:`__hash__`» , явно вызывающий исключение «:exc:`TypeError`» ) .

source: If a class that overrides :meth:`__eq__` needs to retain the implementation of :meth:`__hash__` from a parent class, the interpreter must be told this explicitly by setting ``__hash__ = <ParentClass>.__hash__``. Otherwise the inheritance of :meth:`__hash__` will be blocked, just as if :attr:`__hash__` had been explicitly set to :const:`None`.
ru: Если классу, переопределившему «:meth:`__eq__`» нужно оставить реализацию «:meth:`__hash__`» из родительского класса, то это нужно обязательно делать явным образом : «``__hash__ = <ParentClass>.__hash__``» . Иначе наследование «:meth:`__hash__`» будет блокировано, так же, как если бы «:meth:`__hash__`» был явно установлен в «:const:`None`» .

source: Called to implement truth value testing and the built-in operation ``bool()``; should return ``False`` or ``True``. When this method is not defined, :meth:`__len__` is called, if it is defined, and the object is considered true if its result is nonzero. If a class defines neither :meth:`__len__` nor :meth:`__bool__`, all its instances are considered true.
ru: Вызывается для реализации проверки значения на истинность и встроенной операции «:func:`bool`» . Должен возвращать «:const:`False`» или «:const:`True`» . Если этот метод не определён, то вызывается «:meth:`__len__`» , если тот определён, и, если результат ненулевой, то данный объект считается значащим «:const:`True`» . Если класс не определяет ни «:meth:`__len__`» , ни «:meth:`__bool__`» , то его экземпляры считаются значащими «:const:`True`» .

source: Customizing attribute access
ru: Настройка доступа к атрибутам

source: Called when an attribute lookup has not found the attribute in the usual places (i.e. it is not an instance attribute nor is it found in the class tree for ``self``). ``name`` is the attribute name. This method should return the (computed) attribute value or raise an :exc:`AttributeError` exception.
ru: Вызывается, когда искомый атрибут не найден в соответствующих местах (тоесть, он не является атрибутом экземпляра и не найден в дереве классов данного экземпляра) . ``name`` – имя атрибута. Этот метод должен возвращать значение (вычисленное) атрибута, или инициировать исключение «:exc:`AttributeError`» .

source: Note that if the attribute is found through the normal mechanism, :meth:`__getattr__` is not called. (This is an intentional asymmetry between :meth:`__getattr__` and :meth:`__setattr__`.) This is done both for efficiency reasons and because otherwise :meth:`__getattr__` would have no way to access other attributes of the instance. Note that at least for instance variables, you can fake total control by not inserting any values in the instance attribute dictionary (but instead inserting them in another object). See the :meth:`__getattribute__` method below for a way to actually get total control over attribute access.
ru: Заметьте, что если атрибут найден обычным способом, то «:meth:`__getattr__`» не вызывается. (Несимметричность в этом смысле между «:meth:`__getattr__`» и «:meth:`__setattr__`» создана намеренно. ) Это сделано и в целях эффективности и из-за того, что иначе у «:meth:`__getattr__`» не было бы никакой возможности доступа к другим атрибутам экземпляра. Кстати, по крайней мере для переменных экземпляра вы можете имитировать тотальный контроль за счёт непомещения их в словарь атрибутов данного экземпляра (а храня их в другом объекте) . Смотрите метод «:meth:`__getattribute__`» ниже, предоставляющий способ действительно полностью контролировать доступ к атрибутам.

source: Called unconditionally to implement attribute accesses for instances of the class. If the class also defines :meth:`__getattr__`, the latter will not be called unless :meth:`__getattribute__` either calls it explicitly or raises an :exc:`AttributeError`. This method should return the (computed) attribute value or raise an :exc:`AttributeError` exception. In order to avoid infinite recursion in this method, its implementation should always call the base class method with the same name to access any attributes it needs, for example, ``object.__getattribute__(self, name)``.
ru: Вызывается безусловно (всегда, когда определён) для реализации доступа к атрибутам экземпляров данного класса. Если в классе также определён «:meth:`__getattr__`» , то он не будет вызван, если только «:meth:`__getattribute__`» не вызовет его явно или не инициирует исключение «:exc:`AttributeError`» . Этот метод нужен, чтобы возвращать значение (вычисленное) атрибута, или инициировать исключение «:exc:`AttributeError`» . Чтобы при доступе к нужным атрибутам избежать бесконечной рекурсии, в реализации этого метода всегда нужно вызывать метод базового класса с тем же именем, например, «``object.__getattribute__(self, name)``» (вместо «``self.name``») .

source: This method may still be bypassed when looking up special methods as the result of implicit invocation via language syntax or built-in functions. See :ref:`special-lookup`.
ru: Этот метод всё же может быть обойдён обращением к специальным методам в результате явного обращения с помощью специального синтаксиса языка или встроенных функций. Смотрите «Обращение к специальным методам» :ref:`special-lookup` .

source: Called when an attribute assignment is attempted. This is called instead of the normal mechanism (i.e. store the value in the instance dictionary). *name* is the attribute name, *value* is the value to be assigned to it.
ru: Вызывается при попытке записи (назначения) атрибута. Он вызывается вместо стандартного механизма (тоесть, вместо сохранения значения в словаре экземпляра) . *name* – имя атрибута, *value* – значение, которое нужно под этим именем сохранить (назначить) .

source: If :meth:`__setattr__` wants to assign to an instance attribute, it should call the base class method with the same name, for example, ``object.__setattr__(self, name, value)``.
ru: Если «:meth:`__setattr__`» хочет получить доступ к атрибуту экземпляра, ему следует вызывать метод базового класса с тем же именем, например, «``object.__setattr__(self, name, value)``» (вместо «``self.name``») .

source: Like :meth:`__setattr__` but for attribute deletion instead of assignment. This should only be implemented if ``del obj.name`` is meaningful for the object.
ru: Подобен «:meth:`__setattr__`» , только вместо назначения – удаляет атрибут. Реализовывать его следует только если «``del obj.name``» должен иметь какой-то специальный смысл для данного объекта.

source: Called when :func:`dir` is called on the object. A list must be returned.
ru: Вызывается, когда вызывается «:func:`dir`» с данным объектом в качестве аргумента . Должен возвращаться список.

source: The following methods only apply when an instance of the class containing the method (a so-called *descriptor* class) appears in the class dictionary of another class, known as the *owner* class. In the examples below, "the attribute" refers to the attribute whose name is the key of the property in the owner class' :attr:`__dict__`.
ru: Следующие методы служат для “перехвата” обращения к объекту, содержащему их. Но есть принципиальные ограничения. Эти методы задействуются только у тех объектов, у которых они определены в их классе (такой класс называется “описатель” ) , и которые (объекты) являются атрибутом другого класса (присутствуют в словаре атрибутов этого класса или его родительских классов) (такой класс называется “владелец” ) . В примерах, данных ниже, “данный атрибут” подразумевает тот атрибут, чьё имя является ключом словаря «:attr:`__dict__`» класса – владельца.

source: Called to get the attribute of the owner class (class attribute access) or of an instance of that class (instance attribute access). *owner* is always the owner class, while *instance* is the instance that the attribute was accessed through, or ``None`` when the attribute is accessed through the *owner*. This method should return the (computed) attribute value or raise an :exc:`AttributeError` exception.
ru: Вызывается для получения “данного атрибута” класса-владельца (доступ к атрибуту класса) или экземпляра класса-владельца (доступ к атрибуту экземпляра) . Аргумент «*owner*» всегда – класс-владелец, а аргумент «*instance*» – это тот экземпляр, через который “данный атрибут” был получен или «:const:`None`» , когда “данный атрибут” был получен через “владельца” . Этот метод должен возвращать значение “данного атрибута” (вычисленное) , или инициировать исключение «:exc:`AttributeError`» .

source: Called to set the attribute on an instance *instance* of the owner class to a new value, *value*.
ru: Вызывается для установки (записи) значения *value* для “данного атрибута” в экземпляре *instance* “класса-владельца” .
